W13/background/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
//    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    outlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    ground
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
	
    walls
    {
        type            slip;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
	
    floatingObject
    {
        type            kqRWallFunction;
		value			uniform 0.1;
    }

    overset
    {
	type		overset;
    }

    sides
    {
	type		overset;
    }
}


// ************************************************************************* //
